; domain
; source: https://github.com/AI-Planning/pddl-generators/blob/main/transport/domain.pddl
; updates:
;  - removed :action-costs and :functions
;  - capacity type now is size
;  - capacity-number predicate now is capacity
(define (domain transport)
  (:requirements :typing)
  (:types
        size location locatable - object
        vehicle package - locatable
  )

  (:predicates
     (road ?l1 ?l2 - location)
     (at ?x - locatable ?v - location)
     (in ?x - package ?v - vehicle)
     (capacity ?v - vehicle ?s1 - size)
     (capacity-predecessor ?s1 ?s2 - size)
  )

  (:action drive
    :parameters (?v - vehicle ?l1 ?l2 - location)
    :precondition (and
        (at ?v ?l1)
        (road ?l1 ?l2)
      )
    :effect (and
        (not (at ?v ?l1))
        (at ?v ?l2)
      )
  )

 (:action pickup
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - size)
    :precondition (and
        (at ?v ?l)
        (at ?p ?l)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s2)
      )
    :effect (and
        (not (at ?p ?l))
        (in ?p ?v)
        (capacity ?v ?s1)
        (not (capacity ?v ?s2))
      )
  )

  (:action drop
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - size)
    :precondition (and
        (at ?v ?l)
        (in ?p ?v)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s1)
      )
    :effect (and
        (not (in ?p ?v))
        (at ?p ?l)
        (capacity ?v ?s2)
        (not (capacity ?v ?s1))
      )
  )

)

; problem
(define (problem transport-22)
 (:domain transport)
 (:objects 
    v1 - vehicle
    p1 p2 p3 p4 - package
    l1 l2 l3 l4 l5 l6 l7 - location
    c0 c1 c2 - size
    )
 (:init
    (capacity v1 c2)
    (capacity-predecessor c0 c1)
    (capacity-predecessor c1 c2)
    (at p1 l3)
    (at p2 l4)
    (at p3 l6)
    (at p4 l1)
    (at v1 l4)
    (road l7 l4)
    (road l1 l5)
    (road l3 l7)
    (road l5 l4)
    (road l5 l1)
    (road l7 l3)
    (road l6 l7)
    (road l4 l5)
    (road l7 l6)
    (road l2 l5)
    (road l4 l7)
    (road l5 l2)
    (road l1 l3)
    (road l3 l1)
    (road l3 l6)
    (road l6 l3)
    (road l1 l7)
    (road l7 l1)
    (road l2 l6)
    (road l6 l2)
    (road l5 l6)
    (road l6 l5)
    (road l2 l3)
    (road l3 l2)
    (road l2 l7)
    (road l7 l2)
    (road l2 l4)
    (road l4 l2)
    )
 (:goal  (and 
    (at p1 l1)
    (at p2 l1)
    (at p3 l1)
    (at p4 l3))))

; plan
1. (drive v1 l4 l7)
   deleted: (at v1 l4)
   added: (at v1 l7)
   goals met: 0 of 4
2. (drive v1 l7 l3)
   deleted: (at v1 l7)
   added: (at v1 l3)
   goals met: 0 of 4
3. (pickup v1 l3 p1 c1 c2)
   deleted: (at p1 l3) (capacity v1 c2)
   added: (in p1 v1) (capacity v1 c1)
   goals met: 0 of 4
4. (drive v1 l3 l1)
   deleted: (at v1 l3)
   added: (at v1 l1)
   goals met: 0 of 4
5. (drop v1 l1 p1 c1 c2)
   deleted: (in p1 v1) (capacity v1 c1)
   added: (at p1 l1) (capacity v1 c2)
   goals met: 1 of 4
6. (drive v1 l1 l5)
   deleted: (at v1 l1)
   added: (at v1 l5)
   goals met: 1 of 4
7. (drive v1 l5 l4)
   deleted: (at v1 l5)
   added: (at v1 l4)
   goals met: 1 of 4
8. (pickup v1 l4 p2 c1 c2)
   deleted: (at p2 l4) (capacity v1 c2)
   added: (in p2 v1) (capacity v1 c1)
   goals met: 1 of 4
9. (drive v1 l4 l5)
   deleted: (at v1 l4)
   added: (at v1 l5)
   goals met: 1 of 4
10. (drive v1 l5 l1)
   deleted: (at v1 l5)
   added: (at v1 l1)
   goals met: 1 of 4
11. (drop v1 l1 p2 c1 c2)
   deleted: (in p2 v1) (capacity v1 c1)
   added: (at p2 l1) (capacity v1 c2)
   goals met: 2 of 4
12. (drive v1 l1 l5)
   deleted: (at v1 l1)
   added: (at v1 l5)
   goals met: 2 of 4
13. (drive v1 l5 l6)
   deleted: (at v1 l5)
   added: (at v1 l6)
   goals met: 2 of 4
14. (pickup v1 l6 p3 c1 c2)
   deleted: (at p3 l6) (capacity v1 c2)
   added: (in p3 v1) (capacity v1 c1)
   goals met: 2 of 4
15. (drive v1 l6 l7)
   deleted: (at v1 l6)
   added: (at v1 l7)
   goals met: 2 of 4
16. (drive v1 l7 l1)
   deleted: (at v1 l7)
   added: (at v1 l1)
   goals met: 2 of 4
17. (drop v1 l1 p3 c1 c2)
   deleted: (in p3 v1) (capacity v1 c1)
   added: (at p3 l1) (capacity v1 c2)
   goals met: 3 of 4
18. (pickup v1 l1 p4 c1 c2)
   deleted: (at p4 l1) (capacity v1 c2)
   added: (in p4 v1) (capacity v1 c1)
   goals met: 3 of 4
19. (drive v1 l1 l3)
   deleted: (at v1 l1)
   added: (at v1 l3)
   goals met: 3 of 4
20. (drop v1 l3 p4 c1 c2)
   deleted: (in p4 v1) (capacity v1 c1)
   added: (at p4 l3) (capacity v1 c2)
   goals met: 4 of 4
